
<script setup>
  import heroMain from "./components/Hero.vue";
  import NavBar from './components/NavBar.vue'
  import AdvantagesMain from "./components/Advantages.vue";
  import ChoiceCar from "./components/ChoiceCar.vue";
  import CalculationMain from "./components/Calculation.vue";
  import RequestForm from "./components/RequestForm.vue";
  import FooterMain from "./components/Footer.vue";
</script>


<template>
  <div id="app" >
<!--    <Hello />-->
    <NavBar/>
<!--    <div class="main container">-->
      <heroMain/>
      <AdvantagesMain/>
      <ChoiceCar
        @slide-change="handleDataUpdated"
        @cars_info="handleCarsUpdated"
      />
      <CalculationMain
      :data="receivedData"
      :cars_data="carsData"
      />
      <RequestForm/>
      <FooterMain/>
<!--    </div>-->
  </div>
</template>

<script>

export default {
  name: 'app',
  data() {
    return {
      receivedData: 0,
      carsData: {
        "cars": [
            {
              "img": "C80",
              "data": [
                  {"1": "", "2": "", "3": 3000, "4": 20000, "5": 40000, "6": 60000, "7": 80000, "9": 100000, "10": 12000 },
                  {"1": "Трудозатраты, н-ч", "2": "", "3": 0, "4": 1, "5": 2, "6": 3, "7": 4, "9": 5, "10": 6 },
                  {"1": "Техническое обслуживание", "2": "", "3": 1.5, "4": 3.0, "5": 9.1, "6": 3.1, "7": 10.7, "9": 3.8, "10": 9.6 },
                  {"1": "Запасные части, шт", "2": ""},
                  {"1": "Масляный фильтр", "2": "C4897898", "3": 1, "4": 1, "5": 1, "6": 1, "7": 1, "9": 1, "10": 1 },
                  {"1": "Воздушный фильтр", "2": "C22612-020X", "3": "", "4": "", "5": 1, "6": "", "7": 1, "9": "", "10": 1 },
                  {"1": "Основной топливный фильтр", "2": "C5262311", "3": "", "4": 1, "5": 1, "6": 1, "7": 1, "9": 1, "10": 1 },
                  {"1": "Фильтр предварительной очистки топлива с сепаратором", "2": "FSP0100", "3": "", "4": "", "5": 1, "6": "", "7": 1, "9": "", "10": 1 },
                  {"1": "Фильтр сжатого воздуха SCR", "2": "1205610-LC3101C", "3": "", "4": "", "5": "", "6": 1, "7": "", "9": "", "10": 1 },
                  {"1": "Фильтр секции впрыска SCR", "2": "C5293131", "3": "", "4": "", "5": "", "6": "", "7": "", "9": "", "10": 1 },
                  {"1": "Фильтр заброника в баке SCR", "2": "C5296452", "3": "", "4": "", "5": "", "6": "", "7": "", "9": "", "10": 1 },
                  {"1": "Осушитель воздуха", "2": "3543010-CA3102C", "3": "", "4": "", "5": "", "6": "", "7": "", "9": 1, "10": "" },
                  {"1": "Сальник ступицы передний", "2": "31Q68-03080", "3": "", "4": "", "5": 2, "6": "", "7": 2, "9": "", "10": 2 },
                  {"1": "Сальник ступицы задний внешний", "2": "24T-01090", "3": "", "4": "", "5": 2, "6": "", "7": 2, "9": "", "10": 2 },
                  {"1": "Сальник ступицы задний внутренний", "2": "31RAS01-04080", "3": "", "4": "", "5": 2, "6": "", "7": 2, "9": "", "10": 2 },
                  {"1": "Масла, технические жидкости и смазки, л. (кг.)*", "2": ""},
                  {"1": "Моторное масло Cummins ISF3.8", "2": "", "3": 10.0, "4": 10.0, "5": 10.0, "6": 10.0, "7": 10.0, "9": 10.0, "10": 10.0 },
                  {"1": "Трансмиссионное масло КПП C6J55T", "2": "", "3": 5.8, "4": "", "5": 5.8, "6": "", "7": 5.8, "9": "", "10": 5.8 },
                  {"1": "Трансмиссионное масло дифференциала", "2": "", "3": 5.5, "4": "", "5": 5.5, "6": "", "7": 5.5, "9": "", "10": 5.5 },
                  {"1": "Рабочая жидкость системы ГУР", "2": "", "3": "", "4": "", "5": 0.7, "6": "", "7": 0.7, "9": "", "10": 0.7 },
                  {"1": "Охлаждающая жидкость двигателя", "2": "", "3": "", "4": "", "5": "", "6": 20.0, "7": "", "9": "", "10": "" },
                  {"1": "Жидкость гидропривода сцепления", "2": "", "3": "", "4": "", "5": 1.0, "6": "", "7": 1.0, "9": "", "10": 1.0 },
                  {"1": "Смазка ступичных подшипников", "2": "", "3": "", "4": "", "5": 0.4, "6": "", "7": 0.4, "9": "", "10": 0.4 },
                  {"1": "Консистентная смазка", "2": "", "3": 1.0, "4": 1.0, "5": 1.0, "6": 1.0, "7": 1.0, "9": 1.0, "10": 1.0 }
              ]
            }
        ]
      }
    };
  },
  methods: {
    handleDataUpdated(data) {
      this.receivedData = data; // получаем данные от ChildComponent1
    },
    handleCarsUpdated(data) {
      this.carsData = data; // получаем данные от ChildComponent1
    },
  },
}
</script>


<style scoped>
  .logo {
    height: 6em;
    padding: 1.5em;
    will-change: filter;
    transition: filter 300ms;
  }
  .logo:hover {
    filter: drop-shadow(0 0 2em #646cffaa);
  }
  .logo.vue:hover {
    filter: drop-shadow(0 0 2em #42b883aa);
  }
</style>
