<template>
  <section class="body-font bg-[#ECECEC] relative w-full ">
    <div class="mx-auto container h-[50vh]">
      <div class="container px-5 py-24 bg-[#f3f1ed] rounded-[98px] absolute -top-32">
        <div class="text-center mb-20">
          <h1 class="text-2xl font-semibold title-font mb-4 uppercase text-black">Преимущества сервесных контраков DONGFENG</h1>
        </div>

        <div class="flex sm:-m-4 -mx-4 -mb-10 -mt-4 md:space-y-0 space-y-6">
          <div class="p-4 md:w-1/3 flex flex-col text-center items-center">
            <div class="w-20 h-20 inline-flex items-center justify-center rounded-full text-green-500 mb-5 flex-shrink-0">
              <svg width="73" height="73" viewBox="0 0 73 73" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M36.5 5.09302C19.1544 5.09302 5.09302 19.1544 5.09302 36.5C5.09302 53.8455 19.1544 67.907 36.5 67.907C53.8455 67.907 67.907 53.8455 67.907 36.5C67.907 19.1544 53.8455 5.09302 36.5 5.09302ZM0 36.5C0 16.3416 16.3416 0 36.5 0C56.6585 0 73 16.3416 73 36.5C73 56.6585 56.6585 73 36.5 73C16.3416 73 0 56.6585 0 36.5ZM33.653 16.9766C33.6968 16.9767 33.7403 16.9767 33.7837 16.9767H41.593C47.6873 16.9767 52.6279 21.9172 52.6279 28.0116C52.6279 34.1059 47.6873 39.0465 41.593 39.0465H32.2558V40.7442H36.5C37.9064 40.7442 39.0465 41.8843 39.0465 43.2907C39.0465 44.6971 37.9064 45.8372 36.5 45.8372H32.2558V53.4767C32.2558 54.8831 31.1157 56.0233 29.7093 56.0233C28.3029 56.0233 27.1628 54.8831 27.1628 53.4767V45.8372H26.314C24.9076 45.8372 23.7674 44.6971 23.7674 43.2907C23.7674 41.8843 24.9076 40.7442 26.314 40.7442H27.1628V39.0465H26.314C24.9076 39.0465 23.7674 37.9064 23.7674 36.5C23.7674 35.0936 24.9076 33.9535 26.314 33.9535H27.1628V23.5977C27.1628 23.5543 27.1627 23.5107 27.1627 23.467C27.1621 22.9729 27.1615 22.4592 27.236 21.9891C27.6386 19.4466 29.6327 17.4526 32.175 17.0499C32.6453 16.9754 33.159 16.976 33.653 16.9766ZM32.2558 33.9535H41.593C44.8746 33.9535 47.5349 31.2932 47.5349 28.0116C47.5349 24.73 44.8746 22.0698 41.593 22.0698H33.7837C33.4544 22.0698 33.2585 22.07 33.1108 22.074C33.017 22.0766 32.9763 22.0802 32.9665 22.0811C32.6076 22.1403 32.3264 22.4216 32.267 22.7804C32.2663 22.7902 32.2626 22.8309 32.2602 22.9247C32.2562 23.0724 32.2558 23.2684 32.2558 23.5977V33.9535Z" fill="#E60020"/>
              </svg>
            </div>
            <div class="flex-grow">
              <h2 class="text-gray-900 text-lg title-font font-semibold mb-8 w-4/5 mx-auto">СНИЖЕНИЕ ЭКСПЛУАТАЦИОННЫХ ЗАТРАТ</h2>
              <p class="leading-relaxed text-sm text-[#A7A7A7] font-medium">Наши специализированные программы сочетают в себе регулярные проверки, замены деталей и закрепленную стоимость технического обслуживания, что помогает снизить общие эксплуатационные расходы и делает владение грузовиком более выгодным для вас.</p>
            </div>
          </div>
          <div class="p-4 md:w-1/3 flex flex-col text-center items-center">
            <div class="w-20 h-20 inline-flex items-center justify-center rounded-full text-green-500 mb-5 flex-shrink-0">
              <svg width="77" height="77" viewBox="0 0 77 77" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M50.3332 38.5C50.3332 45.0356 45.0354 50.3334 38.4998 50.3334C31.9643 50.3334 26.6665 45.0356 26.6665 38.5C26.6665 31.9645 31.9643 26.6667 38.4998 26.6667C45.0354 26.6667 50.3332 31.9645 50.3332 38.5Z" stroke="#E60020" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M42.0681 3.23686C41.2564 3 40.3377 3 38.5 3C36.6623 3 35.7436 3 34.9319 3.23686C33.7438 3.58354 32.6942 4.29409 31.9309 5.26849C31.4095 5.93419 31.0683 6.7873 30.3859 8.49351C29.4049 10.9462 26.6822 12.2091 24.176 11.3741L21.9246 10.6239C20.3276 10.0915 19.529 9.82531 18.7461 9.77971C17.596 9.7127 16.4513 9.98293 15.4527 10.5572C14.7728 10.9481 14.1776 11.5433 12.9872 12.7337C11.722 13.9989 11.0894 14.6315 10.6876 15.3536C10.0971 16.4144 9.84736 17.6313 9.97216 18.839C10.0571 19.6609 10.3893 20.4916 11.0538 22.1529C12.0945 24.7545 11.0934 27.7269 8.69073 29.1687L7.59611 29.8257C5.92011 30.8312 5.08211 31.3341 4.47341 32.0264C3.93475 32.6389 3.52859 33.3564 3.28041 34.1335C3 35.0115 3 35.9984 3 37.9726C3 40.3101 3 41.4784 3.37322 42.4792C3.70302 43.3631 4.23942 44.1551 4.93767 44.7898C5.7279 45.5077 6.80225 45.9376 8.95082 46.7971C11.1466 47.6752 12.2772 50.1128 11.5293 52.3564L10.6807 54.9026C10.0929 56.6657 9.79892 57.5477 9.77222 58.4139C9.74007 59.4556 9.9836 60.4871 10.4782 61.4042C10.8895 62.1675 11.5467 62.8246 12.8611 64.1389C14.1755 65.4532 14.8327 66.1103 15.5956 66.5217C16.5129 67.0164 17.5445 67.2601 18.5861 67.2278C19.4524 67.201 20.3341 66.9071 22.0976 66.3194L24.1762 65.6263C26.6822 64.7913 29.4049 66.0539 30.3859 68.5066C31.0683 70.2125 31.4095 71.0657 31.9309 71.7315C32.6942 72.7058 33.7438 73.4166 34.9319 73.7633C35.7436 74 36.6623 74 38.5 74C40.3377 74 41.2564 74 42.0681 73.7633C43.2562 73.4166 44.3058 72.7058 45.0691 71.7315C45.5905 71.0657 45.9317 70.2125 46.6141 68.5066C47.5951 66.0539 50.3179 64.7913 52.8235 65.6271L54.9006 66.3198C56.6642 66.9075 57.5461 67.2014 58.4123 67.2282C59.4541 67.2601 60.4855 67.0168 61.4026 66.5221C62.1655 66.1107 62.823 65.4536 64.1373 64.1393C65.4516 62.825 66.1087 62.1675 66.5202 61.4046C67.0148 60.4875 67.2582 59.4557 67.2262 58.4143C67.1994 57.5481 66.9055 56.6661 66.3178 54.9026L65.4697 52.3584C64.7215 50.114 65.8524 47.6756 68.049 46.7971C70.1976 45.9376 71.272 45.5077 72.0625 44.7898C72.7607 44.1551 73.2971 43.3631 73.6269 42.4792C74 41.4784 74 40.3101 74 37.9726C74 35.9984 74 35.0115 73.7195 34.1335C73.4714 33.3564 73.0652 32.6389 72.5267 32.0264C71.9177 31.3341 71.0799 30.8312 69.4039 29.8257L68.3078 29.1681C65.9052 27.7264 64.9037 24.7542 65.9447 22.1526C66.6089 20.4914 66.9414 19.6607 67.0262 18.8386C67.1509 17.631 66.9012 16.4141 66.3107 15.3533C65.9088 14.6312 65.2765 13.9986 64.0111 12.7334C62.8207 11.543 62.2254 10.9478 61.5458 10.5569C60.5471 9.98261 59.4024 9.71242 58.2522 9.7794C57.4692 9.82503 56.6709 10.0912 55.0738 10.6235L52.8239 11.3735C50.318 12.2089 47.5951 10.9461 46.6141 8.49351C45.9317 6.7873 45.5905 5.93419 45.0691 5.26849C44.3058 4.29409 43.2562 3.58354 42.0681 3.23686Z" stroke="#E60020" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div class="flex-grow">
              <h2 class="text-gray-900 text-lg title-font font-semibold mb-8 w-4/5 mx-auto">ПОВЫШЕННАЯ ПРОИЗВОДИТЕЛЬНОСТЬ</h2>
              <p class="leading-relaxed text-sm text-[#A7A7A7] font-medium">В рамках обслуживания грузовика DONGFENG по контракту мы заботимся о каждой детали вашего транспортного средства и обеспечиваем его бесперебойную работу и стабильную производительность в течение долгого времени.</p>
            </div>
          </div>
          <div class="p-4 md:w-1/3 flex flex-col text-center items-center">
            <div class="w-20 h-20 inline-flex items-center justify-center rounded-full text-green-500 mb-5 flex-shrink-0">
              <svg width="69" height="76" viewBox="0 0 69 76" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M22.6415 38.0876L30.4981 45.9442L46.2113 30.231M65.8528 38.0876C65.8528 55.6122 44.4043 68.3108 36.946 72.197C36.1395 72.6174 35.7361 72.8275 35.1767 72.9364C34.7407 73.0212 34.1121 73.0212 33.6761 72.9364C33.1167 72.8275 32.7133 72.6174 31.9068 72.197C24.4484 68.3108 3 55.6122 3 38.0876V23.2292C3 20.0884 3 18.5181 3.51367 17.1682C3.96742 15.9757 4.7048 14.9117 5.66205 14.0681C6.74564 13.1132 8.216 12.5618 11.1567 11.459L32.2195 3.56047C33.0362 3.25422 33.4443 3.10109 33.8647 3.04036C34.2371 2.98655 34.6158 2.98655 34.9882 3.04036C35.4085 3.10109 35.8166 3.25422 36.6333 3.56047L57.6961 11.459C60.6368 12.5618 62.1072 13.1132 63.1906 14.0681C64.1479 14.9117 64.8853 15.9757 65.339 17.1682C65.8528 18.5181 65.8528 20.0884 65.8528 23.2292V38.0876Z" stroke="#E60020" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div class="flex-grow">
              <h2 class="text-gray-900 text-lg title-font font-semibold mb-8 w-3/5 mx-auto">ПРЕДОТВРАЩЕНИЕ СБОЕВ</h2>
              <p class="leading-relaxed text-sm text-[#A7A7A7] font-medium">Наши программы предусматривают систематическую проверку всех ключевых компонентов грузовика, что позволяет выявлять и предотвращать потенциальные проблемы с вашим автомобилем до того, как они станут серьезными</p>
            </div>
          </div>
          <div class="p-4 md:w-1/3 flex flex-col text-center items-center">
            <div class="w-20 h-20 inline-flex items-center justify-center rounded-full text-green-500 mb-5 flex-shrink-0">
              <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M69 69H14.7333C10.6263 69 8.57275 69 7.00407 68.2007C5.6242 67.4978 4.50234 66.3758 3.7993 64.996C3 63.4274 3 61.3737 3 57.2667V3M17.6667 47L36 25L50.6667 39.6667L69 17.6667" stroke="#E60020" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
              </svg>
            </div>
            <div class="flex-grow">
              <h2 class="text-gray-900 text-lg title-font font-semibold mb-8 w-4/5 mx-auto">ОПТИМИЗАЦИЯ ОБСЛУЖИВАНИЯ</h2>
              <p class="leading-relaxed text-sm text-[#A7A7A7] font-medium">Сервисные контракты DONGFENG предоставляют вам максимальную гибкость планирования, благодаря чему вы можете минимизировать простои и проводить техническое обслуживание вашего транспортного средства в удобное для вас время.</p>
            </div>
          </div>

        </div>

      </div>
    </div>
  </section>

</template>

<script>
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'AdvantagesMain',
  computed: {
    isLoggedIn: function() {
      return this.$store.getters.isAuthenticated;
    }
  },
  methods: {
    async logout () {
      await this.$store.dispatch('logOut');
      // this.$router.push('/login');
    }
  },
});
</script>

<style scoped>

</style>